Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9273/TLE9273.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>STAT</name>
			<description>Status</description>
			<baseAddress>0b1000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SUP_STAT</name>
					<description>Supply Voltage Fail Status</description>
					<addressOffset>1</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>POR</name>
							<description>Power-On Reset Detection</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No POR</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>POR occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VLIN_UV</name>
							<description>VLIN Under-Voltage Detection</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VLIN_UV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VLIN_UV detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_OV</name>
							<description>Vcc1 Over-Voltage Detection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VCC1 OV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 OV detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC2_OT</name>
							<description>VCC2 Over Temperature Detection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No over temperature</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC2 over temperature detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC2_UV</name>
							<description>VCC2 Under Voltage Detection ()</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VCC2 Under voltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC2 under voltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_SC</name>
							<description>VCC1 Short to GND Detection (&lt;Vrtx for t&gt;2ms after switch on)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No short</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 short to GND detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_UV</name>
							<description>VCC1 UV-Detection (due to Vrtx reset)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VCC1_UV detection</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 UV-Fail detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>THERM_STAT</name>
					<description>Thermal Protection Status</description>
					<addressOffset>2</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TSD2_SAFE</name>
							<description>TSD2 Thermal Shut-Down Safe State Detection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No TSD2 safe state detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>TSD2 safe state detected: &gt;16 consecutive TSD2 events occurred, next TSD2 waiting time will be 60s</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSD2</name>
							<description>TSD2 Thermal Shut-Down Detection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No TSD2 event</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>TSD2 OT detected - leading to SBC Fail-Safe Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSD1</name>
							<description>TSD1 Thermal Shut-Down Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No TSD1 fail</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>TSD1 OT detected (affected module is disabled)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TPW</name>
							<description>Thermal Pre Warning</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Thermal Pre warning</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Thermal Pre warning detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DEV_STAT</name>
					<description>Device Information Status</description>
					<addressOffset>3</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DEV_STAT</name>
							<description>Device Status before Restart Mode</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>cleared</name>
									<description>Cleared (Register must be actively cleared)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>failure</name>
									<description>Restart due to failure (WD fail, TSD2, VCC1_UV, trial to access SLEEP MODE without any wake source activated); also after a wake from Fail-Safe Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sleep_Mode</name>
									<description>Sleep Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>Reserved</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RO_CL_HIGH</name>
							<description>Reset PIN Clamped to HIGH level detected</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Reset Clamped to HIGH detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Reset Clamped to HIGH detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FSI_FAIL</name>
							<description>FSI Fail information</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No FSI fail</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Failure on FSI pattern recognized</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_FAIL</name>
							<description>Number of WD-Failure Events (1/2 WD failures depending on CFG1)</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WD Fail</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>1x WD Fail, FO activation - Config 2 selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2x WD Fail, FO activation - Config 1 / 3 / 4 selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>Reserved (never reached)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI_FAIL</name>
							<description>SPI Fail Information</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No SPI fail</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Invalid SPI command detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FO_ON_STATE</name>
							<description>Activation of Fail Output FO</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Failure</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Failure occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_STAT_1</name>
					<description>Bus Communication Status</description>
					<addressOffset>4</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>LIN1_FAIL</name>
							<description>LIN1 Failure Status</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No error</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN1 TSD</name>
									<description>LIN1 TSD</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN1_TXD_DOM</name>
									<description>TXD dominant time out for more than 20ms</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN1_BUS_DOM</name>
									<description>BUS dominant time out for more than 20ms</description>
									<value>0b11</value>
								</enumeratedValue>							
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_FAIL</name>
							<description>CAN Failure Status</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TSD_shutdown</name>
									<description>CAN TSD shutdown</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD_DOM</name>
									<description>CAN_TXD_DOM: TXD dominant time out detected ()</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUS_DOM (11)</name>
									<description>CAN_BUS_DOM: BUS dominant time out detected ()</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCAN_UV</name>
							<description>Undervoltage CAN Bus Supply</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>detected</name>
									<description>Normal operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>not_detected</name>
									<description>CAN Supply undervoltage detected. Transmitter disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_STAT_2</name>
					<description>Bus Communication Status</description>
					<addressOffset>5</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>LIN4_FAIL</name>
							<description>LIN Failure Status</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_error</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN4_TSD_shutdown</name>
									<description>LIN TSD shutdown, also TSD1 signaled</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN4_TXD_DOM</name>
									<description>LIN_TXD_DOM: TXDLIN dominant time out</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN4_BUS_DOM</name>
									<description>LIN_BUS_DOM: BUS dominant time out</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN3_FAIL</name>
							<description>LIN Failure Status</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_error</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN3_TSD_shutdown</name>
									<description>LIN TSD shutdown, also TSD1 signaled</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN3_TXD_DOM</name>
									<description>LIN_TXD_DOM: TXDLIN dominant time out</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN3_BUS_DOM</name>
									<description>LIN_BUS_DOM: BUS dominant time out</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN2_FAIL</name>
							<description>LIN2 Failure Status</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_error</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN2_TSD_shutdown</name>
									<description>LIN TSD shutdown, also TSD1 signaled</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN2_TXD_DOM</name>
									<description>LIN_TXD_DOM: TXDLIN dominant time out</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN2_BUS_DOM</name>
									<description>LIN_BUS_DOM: BUS dominant time out</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_STAT_1</name>
					<description>Wake-up Source and Information Status</description>
					<addressOffset>6</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>PFM_PWM</name>
							<description>PFM_PWM automatic transition detected</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No automatic PFM_PWM transition detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Automatic PFM_PWM transition detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_WU</name>
							<description>Wake up via CAN Bus</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMER_WU</name>
							<description>Wake up via TimerX</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK_WU</name>
							<description>Wake up via WK</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_STAT_2</name>
					<description>Wake-up Source and Information Status</description>
					<addressOffset>7</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>LIN4_WU</name>
							<description>Wake up via LIN4 Bus</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN3_WU</name>
							<description>Wake up via LIN3 Bus</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN2_WU</name>
							<description>Wake up via LIN2 Bus</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN1_WU</name>
							<description>Wake up via LIN1 Bus</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
