Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9273/TLE9273.svd
				<register>
					<name>WK_LVL_STAT</name>
					<description>WK Input Level</description>
					<addressOffset>8</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TEST</name>
							<description>Status of TEST Pin</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>LOW Level (=0)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>HIGH Level (=1), SBC Software Development Mode is enabled, No reset triggered due to wrong watchdog trigger</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG2_STATE</name>
							<description>Status of CFG2 bit on HW_CTRL register</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>LOW Level; Fail Outputs (FOx) are active after 2nd watchdog trigger fail Config 3</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>HIGH Level; Fail Outputs (FOx) are active after 1st watchdog trigger fail Config 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK</name>
							<description>Status of WK</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>Low Level (=0)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>High Level (=1)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SMPS_STAT</name>
					<description>SMPS state</description>
					<addressOffset>12</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>BST_ACT</name>
							<description>Boost Regulator Active</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_active</name>
									<description>Boost not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>Boost active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BST_SH</name>
							<description>BSTD and SNSP short detection</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No short detected on BSTD and SNSP pins</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>BSTD or SNSP pins short to GND</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BST_OP</name>
							<description>BSTD, SNSP SNSN open detection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No open detection in BSTD, SNSP and SNSN pins</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Or operation between: BSTD loss of diode detected, SNSP loss of resistor detected, SNSN loss of GND detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BST_GSH</name>
							<description>BSTG pin short detection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>BSTG no short detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>BSTG short detected to GND or internal supply</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCK_SH</name>
							<description>BCKSW pin short detection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No short detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Short to GND or short to VS detected on BCKSW pin</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCK_OP</name>
							<description>BCKSW pin open detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No BCKSW open detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>BCKSW open detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCK_OOR</name>
							<description>VCC1 Out of Range</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>inside</name>
									<description>VCC1 inside VCC1,out1±12%</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>outside</name>
									<description>VCC1 outside VCC1,out1±12%</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FAM_PROD_STAT</name>
					<description>Family and Product Identification Register</description>
					<addressOffset>30</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>FAM</name>
							<description>SBC Family Identifier (bit4=LSB; bit7=MSB)</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HERA</name>
									<description>Driver SBC Family (HERA)</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HERCULES</name>
									<description>DC/DC-SBC Family (HERCULES)</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ATHENA</name>
									<description>Mid-Range SBC Family (ATHENA)</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCP</name>
									<description>Multi-CAN SBC Family (MCP)</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LITE</name>
									<description>LITE SBC Family (LITE)</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ATHENA+</name>
									<description>Mid-Range+ SBC Family (ATHENA+)</description>
									<value>0b0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROD</name>
							<description>SBC Product Identifier (bit0=LSB; bit3=MSB)</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>reserved_0</name>
									<description>reserved</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved_1</name>
									<description>reserved</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9461ES</name>
									<description>TLE9461ES (VCC1 = 5V, no SWK)</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9461ESV33</name>
									<description>TLE9461ESV33 (VCC1 = 3.3V, no SWK)</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9461-3ES</name>
									<description>TLE9461-3ES (VCC1 = 5V, SWK) (default value if device is not fused)</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9461-3ESV33</name>
									<description>TLE9461-3ESV33 (VCC1 = 3.3V, SWK)</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved_8</name>
									<description>reserved</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved_9</name>
									<description>reserved</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9471ES</name>
									<description>TLE9471ES (VCC1 = 5V, no SWK)</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9471ESV33</name>
									<description>TLE9471ESV33 (VCC1 = 3.3V, no SWK)</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9471-3ES</name>
									<description>TLE9471-3ES(VCC1 = 5V, SWK)</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9471-3ESV33</name>
									<description>TLE9471-3ESV33 (VCC1 = 3.3V, SWK)</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>